from django.shortcuts import render

blog_post = [
    {
        'title': "নির্বাচন পর্যবেক্ষণে আসবে ইইউর চার সদস্যের কারিগরি দল",
        'content': "পূর্ণাঙ্গ পর্যবেক্ষক মিশন না পাঠালেও বাংলাদেশের আগামী জাতীয় সংসদ নির্বাচন পর্যবেক্ষণে চার সদস্যের "
                   "একটি কারিগরি দল (টেকনিক্যাল টিম) পাঠাবে ইউরোপীয় ইউনিয়ন (ইইউ)।বিষয়টি তারা চিঠি দিয়ে ব্রাসেলসে "
                   "বাংলাদেশের রাষ্ট্রদূতকে জানিয়েছে। আজ বৃহস্পতিবার ইইউর এ–সংক্রান্ত চিঠি নির্বাচন কমিশন পেয়েছে।",
        'author': "রয়টার্স",
        'post_create_data': "আপডেট: ২০ অক্টোবর ২০২৩, ১৫: ৫৭",
    },

    {
        'title': "মামুনুল হকসহ নেতাকর্মীদের মুক্তির দাবিতে তিন দিনের কর্মসূচি ঘোষণা",
        'content': "হেফাজতে ইসলামের বিলুপ্ত কমিটির যুগ্ম মহাসচিব ও বাংলাদেশ খেলাফত মজলিসের মহাসচিব মামুনুল"
                   " হকসহ কারাবন্দী ওলামায়ে কেরামের মুক্তির দাবিতে তিন দিনের কর্মসূচি ঘোষণা করা হয়েছে। আজ শুক্রবার"
                   " বিকেলে রাজধানীর জাতীয় মসজিদ বায়তুল মোকাররমের  উত্তর পাশের সড়কে আয়োজিত যুব সমাবেশ থেকে "
                   "এই কর্মসূচি ঘোষণা করা হয়। সমাবেশের আয়োজন করে বাংলাদেশ খেলাফত যুব মজলিস।",
        'author': "মামুনুল হকছবি: ফেসবুক থেকে নেওয়া",
        'post_create_data': "আপডেট: ২০ অক্টোবর ২০২৩, ১৯: ১১",
    },

    {
        'title': "২৮ অক্টোবর বিএনপির পরিণতি হবে ১০ ডিসেম্বরের মতো: কাদের",
        'content': "২৮ অক্টোবর বিএনপির পরিণতি ১০ ডিসেম্বরের মতো হবে বলে মন্তব্য করেছেন আওয়ামী লীগের সাধারণ "
                   "সম্পাদক ওবায়দুল কাদের। তিনি বলেন, ১০ ডিসেম্বর তারা গোলাপবাগ গরুর হাটের খাদে পড়েছিল, "
                   "এবার কোথায় যাবে, সেটা দেখার অপেক্ষায়।"
                   "আজ শুক্রবার রাজধানীর ধানমন্ডিতে আওয়ামী লীগ সভাপতি শেখ হাসিনার রাজনৈতিক কার্যালয়ে পূজা উদ্‌যাপন পরিষদের "
                   "নেতাদের সঙ্গে বৈঠক শেষে সাংবাদিকদের প্রশ্নের জবাবে এসব কথা বলেন ওবায়দুল কাদের।",
        'post_create_data': "প্রকাশ: ২০ অক্টোবর ২০২৩, ১৮: ১৪",
    }
]


def homepage(request):
    return render(request, 'home/homepage.html', {"blog_post": blog_post})


def about(request):
    return render(request, 'home/about.html', {"title": "About page"})
