from django.shortcuts import render

blog_post = [
    {
        'title': "নির্বাচন পর্যবেক্ষণে আসবে ইইউর চার সদস্যের কারিগরি দল",
        'content': "পূর্ণাঙ্গ পর্যবেক্ষক মিশন না পাঠালেও বাংলাদেশের আগামী জাতীয় সংসদ নির্বাচন পর্যবেক্ষণে চার সদস্যের "
                   "একটি কারিগরি দল (টেকনিক্যাল টিম) পাঠাবে ইউরোপীয় ইউনিয়ন (ইইউ)।বিষয়টি তারা চিঠি দিয়ে ব্রাসেলসে "
                   "বাংলাদেশের রাষ্ট্রদূতকে জানিয়েছে। আজ বৃহস্পতিবার ইইউর এ–সংক্রান্ত চিঠি নির্বাচন কমিশন পেয়েছে।",
        'author': "রয়টার্স",
        'post_create_data': "নির্বাচন কমিশন সচিবালয়ের অতিরিক্ত সচিব অশোক কুমার দেবনাথ প্রথম আলোকে এসব তথ্য জানিয়েছেন। "
                            "তিনি বলেন, ইইউ জানিয়েছে, তাদের চার সদস্যের একটি কারিগরি দল নির্বাচন পর্যবেক্ষণে পাঠাবে। "
                            "দলটি ২১ নভেম্বর থেকে ২১ জানুয়ারি পর্যন্ত বাংলাদেশে অবস্থান করবে বলে জানানো হয়েছে।"
                            "বাংলাদেশে জাতীয় নির্বাচনের পরিবেশসহ নির্বাচন–পূর্ব রাজনৈতিক পরিস্থিতি পর্যালোচনায় ইইউর "
                            "প্রাক্-নির্বাচন পর্যবেক্ষক দলটি গত জুলাই মাসে বাংলাদেশ সফর করেছিল। বাংলাদেশ সফরকালে "
                            "তারা নির্বাচন কমিশনসহ বিভিন্ন অংশীজনের সঙ্গে বৈঠক করে।প্রাক্-নির্বাচন পর্যবেক্ষক দলের "
                            "ঢাকা সফরের সময়ই বলা হয়েছিল, তারা যে প্রতিবেদন দেবে, তার ওপর ভিত্তি করে আগামী "
                            "জাতীয় নির্বাচনে ইইউর পূর্ণাঙ্গ পর্যবেক্ষক দল পাঠানোর বিষয়ে সেপ্টেম্বরে চূড়ান্ত সিদ্ধান্ত জানানো হবে। "
                            "এরপর গত ২০ সেপ্টেম্বর পূর্ণাঙ্গ পর্যবেক্ষক দল না পাঠানোর সিদ্ধান্ত জানায় ইইউ।এখন ইউরোপীয় "
                            "ইউনিয়ন ছোট একটি দল পাঠানোর সিদ্ধান্ত জানিয়ে নির্বাচন কমিশনকে চিঠি পাঠাল।",
    }
]


def homepage(request):
    return render(request, 'home/homepage.html', {"blog_post": blog_post})


def about(request):
    return render(request, 'home/about.html', {"title": "About page"})
